app/controllers/posts_controller.rb

	def create
	  @post = Post.new(params)
	  @post.save
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "This Is A New Post"], ["description", "this is a brief description"], ["created_at", "2019-06-01 23:30:10.854243"], ["updated_at", "2019-06-01 23:30:10.854243"]]